### Task2 : Loading Dataset and Basic Inspection

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("./data/student.csv")

In [3]:
display(df.head())

   StudentID   Name  Age Gender  Marks  Attendance
0          1   Amit   21      M     78          85
1          2   Neha   22      F     34          60
2          3   Ravi   20      M     56          75
3          4  Pooja   23      F     89          90
4          5  Karan   21      M     42          65

In [5]:
display(df.tail())

   StudentID    Name  Age Gender  Marks  Attendance
1          2    Neha   22      F     34          60
2          3    Ravi   20      M     56          75
3          4   Pooja   23      F     89          90
4          5   Karan   21      M     42          65
5          6  Anjali   22      F     91          95

In [7]:
display(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   StudentID   6 non-null      int64
 1   Name        6 non-null      object
 2   Age         6 non-null      int64
 3   Gender      6 non-null      object
 4   Marks       6 non-null      int64
 5   Attendance  6 non-null      int64
dtypes: int64(4), object(2)
memory usage: 420.0+ bytes

None

In [8]:
display(df.describe())

       StudentID        Age      Marks  Attendance
count   6.000000   6.000000   6.000000    6.000000
mean    3.500000  21.500000  65.000000   78.333333
std     1.870829   1.048809  24.462216   14.023789
min     1.000000  20.000000  34.000000   60.000000
25%     2.250000  21.000000  45.500000   67.500000
50%     3.500000  21.500000  67.000000   80.000000
75%     4.750000  22.000000  86.250000   88.750000
max     6.000000  23.000000  91.000000   95.000000